Courses/7370/Lectures/Fundas/semicolon-par-fat-bars.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-31 Fri 15:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Semantics of ; || []</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="WSU CEG 7370 Distributed Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Semantics of ; || []</h1>
<p>
For now, let us focus on executional semantics.  We will revisit these
after Hoare's Axioms and Dijkstra's Weakest Preconditions.
</p>

<div id="outline-container-orgaa49b93" class="outline-2">
<h2 id="orgaa49b93"><span class="section-number-2">1</span> Semantics of Semicolon ;</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Consider the execution of S &equiv; S1 ; S2.  Think of semi-colon as
an operator, much like + * are arithmetic operators.</li>
<li>What is the meaning of S given the meanings of S1 and S2?</li>

<li>Let Tb(Si) stand for the state at the beginning of Si, and Te(Si)
at the end.  Let tb(Si) stand for the timestamp of when Si began,
and te(Si) when it ended (if it did).</li>

<li>The meaning of S1 tells us about the relation between Te(S1) and Tb(S1).</li>
<li>Clearly, Tb(S2) = Te(S1) and tb(S2) &gt;= te(S1)</li>
<li>Must tb(S2) == te(S1)?</li>
<li>Is it acceptable if tb(S2) == te(S1) + 10 hours?</li>
</ol>
</div>
</div>

<div id="outline-container-orge92d34b" class="outline-2">
<h2 id="orge92d34b"><span class="section-number-2">2</span> Semantics of Parallel Bar ||</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Let S &equiv; S1 || S2.  Often written as <code>co S1 || s2 oc</code></li>
<li>Is {S1 || S2} the same as {S2 || S1}?</li>
<li>Must it be tb(S2) == tb(S1)?
<ol class="org-ol">
<li>Even so, we cannot expect that te(S2) == te(S1)</li>
</ol></li>
<li>Is it acceptable/ necessary: tb(S2) &gt;= te(S1)?</li>
<li>Is it acceptable:  tb(S2) &lt; tb(S1)?</li>
<li>te(S) == max(te(S1), te(S2))?</li>
<li>tb(S) == min(tb(S1), tb(S2))?</li>
<li>Is {S1 ; S2} a "pathological" version of  {S1 || S2}?</li>
</ol>
</div>
</div>

<div id="outline-container-org798410b" class="outline-2">
<h2 id="org798410b"><span class="section-number-2">3</span> Semantics of Fat Bar []</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Let S &equiv; S1 [] S2.  Non-determinism
<ol class="org-ol">
<li>This is <b>defined</b> as execute one of S1 or S2.  Never both.</li>
<li>Choice is <b>deliberately</b> unspecified.</li>
</ol></li>
<li>Is {S1 [] S2} the same as {S2 [] S1}?</li>
<li>Non-determinism does <b>not</b> mean random.</li>
</ol>
</div>
</div>

<div id="outline-container-org853dfdd" class="outline-2">
<h2 id="org853dfdd"><span class="section-number-2">4</span> Guarded Commands of Dijkstra</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8bb48de" class="outline-3">
<h3 id="org8bb48de"><span class="section-number-3">4.1</span> IF statement</h3>
<div class="outline-text-3" id="text-4-1">
<p>
if G0 ==&gt; S0<br />
[] G1 ==&gt; S1<br />
&#x2026;<br />
[] Gn ==&gt; Sn<br />
fi<br />
</p>

<p>
The Gi are boolean expressions, called the guards.  Imagine: The Gi
are evaluated at the top of the if-stmt.  An Si is enbaled if its
Gi evalueted to true.  If multiple Gi were true, all the corresponding
Si are enabled.
</p>

<p>
Case 1: One or more Si are enabled. From among the enabled Si, choose
one non-determininistically, and execute it.
</p>

<p>
Case 2: If no Si are enabled the if-stmt aborts.
</p>
</div>
</div>

<div id="outline-container-org1507591" class="outline-3">
<h3 id="org1507591"><span class="section-number-3">4.2</span> DO statement</h3>
<div class="outline-text-3" id="text-4-2">
<p>
do G0 ==&gt; S0<br />
[] G1 ==&gt; S1<br />
&#x2026;<br />
[] Gn ==&gt; Sn<br />
od<br />
</p>

<ol class="org-ol">
<li>This gives us a loop.</li>
<li>Corresp if-stmt: Replace the <code>do</code> with <code>if</code> and <code>fi</code> for <code>od</code>.</li>
<li>The do-stmt terminates if and when all the guards are false.</li>
<li>We execute the corresp if-stmt first. If any of the guards were
true, then we execute the do-stmt again.</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org246625c" class="outline-2">
<h2 id="org246625c"><span class="section-number-2">5</span> Exercise</h2>
<div class="outline-text-2" id="text-5">
<p>
Consider
{y := 0; z := 0; co x := y + z || {y := 1; z := 2} co}
How can x be 0, 1, 2 or 3 on page 60 of Andrew's Concurrent Programming?
</p>
</div>
</div>

<div id="outline-container-org437acd9" class="outline-2">
<h2 id="org437acd9"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 
</div>
</body>
</html>
